#+title: Contents

Brief table of contents and todo list. Malawi has 5 rounds of data, corresponding to IHS2-IHS5 plus IHPS.

* The three =groupby().first()= sites in =malawi.py= (GH #637)

Reviewed for *key soundness* -- the only thing that makes a
=.first()= wrong.  =.first()= defaults to =skipna=True=, so a group of
several rows collapses to a *composite* assembled from the first
non-null value of each column independently, i.e. a row that appears
nowhere in the survey.  That is *usually correct*: NULL is absence, not
contradiction.  It is wrong only when the duplicate rows describe
*different real entities*, which is a broken identifier and is fixed at
the identifier (#323 D1), never by =skipna=False=.

*Method.*  =DataFrameGroupBy.first= was patched in-process and the wave
scripts driven with =runpy=.  All three tables are =materialize: make=,
so an in-process patch cannot see them if they are built through the
subprocess -- an earlier probe of a site like this reported a
meaningless "0" for exactly that reason.  Run cold, in an isolated
=LSMS_DATA_DIR=.

| site (=malawi.py=)            | groups >1 row | verdict                       |
|-------------------------------+---------------+-------------------------------|
| =plot_features_for_wave=      |             0 | key sound; =.first()= no-op   |
| =food_coping_for_wave=        |             0 | key sound; =.first()= no-op   |
| =months_food_inadequate_for_wave= |         0 | key sound; =.first()= no-op   |

*No composite is ever built at any of the three*, because no group ever
has more than one row to build one from.  For the two Module-H sites
the rows in equal the groups out *exactly* -- 61,355 / 19,994 / 62,232
/ 57,157 for =food_coping= and 12,271 / 4,000 / 12,447 / 11,434 for
=months_food_inadequate=, the latter being precisely each wave's Module
H household count.

** The three traps, and which check answers each

*"They're only exact duplicates" is not reassurance* and *a key can
look invariant merely by being null*.  Both are disposed of by the same
exact equality above: a household id shared by two rows, or two
distinct ids merged by =format_id=, would each surface as a duplicate
group, and there are none; and no key column is null in either
Module-H table.  Confirmed at source: =case_id= / =y2_hhid= are unique
in Module H and =format_id= collapses no two of them.

*A broken key can produce ZERO duplicates* -- the Tanzania inversion,
which turns the duplicate-count instrument inside out.
=Tanzania/2008-15='s =shocks= built =i= from the panel-LINE index
instead of the household id; the namespaces shared no values, so every
replicated line became its own distinct "household" and
=groupby().first()= reported 0 duplicate groups, indistinguishable
from a sound key.  So *"0 duplicates" is not sufficient*.  The check
that catches it is a *per-wave* namespace overlap against the roster --
per wave, never in aggregate, because clean waves otherwise carry
broken ones.  Run for all three tables:

| table                  | 2010-11 | 2013-14 | 2016-17 | 2019-20 |
|------------------------+---------+---------+---------+---------|
| plot_features          |    100% |    100% |    100% |    100% |
| food_coping            |    100% |    100% |    100% |    100% |
| months_food_inadequate |    100% |    100% |    100% |    100% |

And not vacuously: the id strings match literally (=101011000014= on
both sides), and the row counts show no namespace inflation -- rows
never exceed source households x strategies.

This was worth running rather than waving away, because *2019-20 has
the surface shape of a namespace split*: its =data_info.yml= runs
=case_id= through =cs_i= (='cs-19-' + format_id=) for =sample= /
=household_roster= / =cluster_features=, while all three wave scripts
pass =i_prefix=''= / bare =format_id=.

*That asymmetry is a deliberate, already-recorded decision, not a
defect* -- see "plot_features (GH #167)" below: "2016-17 cross-sectional
id is =cs-17-=-prefixed in =sample()= ...; the wave script applies the
same prefix so XS plots are not ~100% orphaned.  *All other halves emit
the raw wave hhid* and rely on framework id_walk / =panel_ids=
chaining."  2019-20 is one of those other halves.  The measurement
confirms the documented expectation rather than contradicting it: the
=cs-19-= prefix survives to the API on *neither* side (0 of 14,612 ids
carry it, in any table), so both sides are in the raw =case_id=
namespace and =i= joins exactly.  2016-17 reaches the same place by the
other route -- prefixed on both sides.  A test pins the overlap per
wave so neither route can drift.

=plot_features= showed 4 apparent duplicate groups (3 in 2016-17
Cross_Sectional, 1 in its Panel half).  Every one of them consists
entirely of rows whose =plot_id= is *NULL* -- there are *zero*
duplicate groups on a real plot id in any wave, so =(hhid, plotkey)=
identifies the plot and no two plots collide on it.

** What the audit did find: 468 rows deleted on a null key

=groupby()= defaults to =dropna=True=, so a =plot_features= row whose
=plot_id= is NULL was being *deleted without a word* -- GH #323 §3b's
delete-and-report, in a country script rather than in core:

| wave    | null plot_id rows |
|---------+-------------------|
| 2010-11 |               275 |
| 2013-14 |               158 |
| 2016-17 |         27 + 6    |
| 2019-20 |          0 + 2    |
| total   |               468 |

They are empty Module C roster stubs, not plots: *0 of all 468* carries
a non-null value in any of =ag_c04a= / =ag_c04b= / =ag_c04c= -- no
farmer-estimated area, no unit, no GPS area.  A row with no plot id and
no measurement cannot go into a =(t, i, plot_id)= table, so dropping it
is right; it just should not have been silent.  The drop is now an
explicit =dropna(subset=['plot_id'])= immediately before the groupby,
which leaves the returned frame bit-for-bit what it was.

*No =.first(skipna=False)= anywhere.*  It would change nothing here
(there are no multi-row groups) and the repo has already rejected that
approach.

* plot_features (GH #167)

Lasting plot-level characteristics.  Schema: =(t, i, plot_id)= index;
columns =Area= (hectares, float), =AreaUnit= (str, always 'acres'),
=Tenure= (str), =TenureSystem= (str), =SoilType= (str), =Irrigated=
(nullable bool).  Latitude / Longitude deferred (Malawi plot GPS is
offset / redacted in the public release).

Built for the four IHS3+ waves; *2004-05 (IHS2) deferred* -- it has no
standard plot roster.  Each wave's =Malawi/<wave>/_/plot_features.py=
merges Module C (area) with Module D (soil / irrigation / tenure) on
=(hhid, plotkey)= and calls the shared =malawi.plot_features_for_wave=
helper; the country-level =Malawi/_/plot_features.py= concatenates them.
=harmonize_tenure= / =harmonize_soil= / =harmonize_irrigation= (Code-keyed)
live in =categorical_mapping.org=.  Registered =materialize: make= in
=data_scheme.yml=.

| Wave    | Module C area file                              | Module D file                                   | hhid                  | plotkey            |
|---------+-------------------------------------------------+-------------------------------------------------+-----------------------+--------------------|
| 2010-11 | Full_Sample/Agriculture/ag_mod_c.dta            | Full_Sample/Agriculture/ag_mod_d.dta            | case_id               | ag_c00 / ag_d00    |
| 2013-14 | AG_MOD_C_13.dta                                 | AG_MOD_D_13.dta                                 | y2_hhid               | ag_c00 / ag_d00    |
| 2016-17 | Cross_Sectional/ag_mod_c.dta + Panel/ag_mod_c_16.dta | Cross_Sectional/ag_mod_d.dta + Panel/ag_mod_d_16.dta | case_id (cs) / y3_hhid | gardenid_plotid    |
| 2019-20 | Cross_Sectional/ag_mod_c.dta + Panel/ag_mod_c_19.dta | Cross_Sectional/ag_mod_d.dta + Panel/ag_mod_d_19.dta | case_id / y4_hhid     | gardenid_plotid    |

Area: prefer GPS-measured =ag_c04c= (acres) x0.404686; else
farmer-estimate =ag_c04a= converted via the =ag_c04b= unit code
(1 Acre, 2 Hectare, 3 Square Meters, 4 Other).  GPS acres > 2500 are
clamped to NaN (data-entry errors).

Wave-specific notes (validated against the recon refuter pass,
=slurm_logs/2026-06-03_session/RECON_Malawi.md=):
- *Tenure* is derived from the labeled acquire question =ag_d03= in
  *2010-11 & 2013-14 ONLY*.  =ag_d03= is ABSENT from IHS4/IHS5
  =ag_mod_d=; the =ag_d02= present there is "ID of Respondent", NOT
  tenure.  So *Tenure / TenureSystem are NaN for 2016-17 & 2019-20*
  (still a required, non-all-NaN column overall).
- *2016-17 Cross_Sectional/ag_mod_d.dta* has a latin-1 bad byte in an
  unused free-text column that makes a full read raise =ReadstatError=.
  A column-restricted read (=usecols=[case_id, hhid, gardenid, plotid,
  ag_d02, ag_d21, ag_d28a]=) succeeds (15,724 rows); the wave script
  uses that path for this one file.
- *2016-17 cross-sectional id* is =cs-17-=-prefixed in =sample()= (the
  =cs_i= mapping the roster uses); the wave script applies the same
  prefix so XS plots are not ~100% orphaned.  All other halves emit the
  raw wave hhid and rely on framework id_walk / =panel_ids= chaining.

* livestock (GAP 4)

Item-level livestock-roster feature.  Schema: =(t, i, animal)= index;
columns =HeadCount= (head owned now, =ag_r02=), =HeadAcquired= (head
bought to raise in the last 12 months, =ag_r10=), =HeadSold= (head sold
alive in the last 12 months, =ag_r16=), =Value= (REPORTED per-head
current value, =ag_r04= -- "if you sold one today, how much would you
receive?").  One reported row per (household, species owned).

Source: Module R livestock roster (=ag_mod_r1_{10,13,16,19}.dta=) -- the
SAME file the World Bank cleaning code reads then *collapses to a single
HH "engaged-in-livestock" binary* (=MWI_IHPS{1-4}.do=: =recode ag_r00 ...
gen(livestock)= then =collapse (max) livestock, by(<hhid>)=).  We keep
the *pre-collapse* roster, which is strictly richer.  Their binary is
recovered as =livestock().groupby(['t','i']).size() > 0=; a TLU rollup
=Sigma(head x species-TLU-factor)= is a =transformations= concern, NOT a
stored column.

Built for the four IHS3+ waves; *2004-05 (IHS2) deferred* -- its ag file
is household-level aggregated, with no Module R roster.  Each wave's
=Malawi/<wave>/_/livestock.py= reshapes the roster via the shared
=malawi._livestock_block= + =malawi.assemble_livestock= helpers; the
country-level =Malawi/_/livestock.py= concatenates them.  Grain is
=(t, i, animal)= with *NO v level* -- 'livestock' is in the framework
=_no_v_join= set (a household holding, not a cluster-keyed roster).
Registered =materialize: make= in =data_scheme.yml=.

| Wave    | Module R file                                        | hhid                   |
|---------+------------------------------------------------------+------------------------|
| 2010-11 | Full_Sample/Agriculture/ag_mod_r1.dta                | case_id                |
| 2013-14 | AG_MOD_R1_13.dta                                     | y2_hhid                |
| 2016-17 | Cross_Sectional/ag_mod_r1.dta + Panel/ag_mod_r1_16.dta | case_id (cs-17) / y3_hhid |
| 2019-20 | Cross_Sectional/ag_mod_r1.dta + Panel/ag_mod_r1_19.dta | case_id / y4_hhid      |

=animal= is the =harmonize_species= Preferred Label (Code-keyed table in
=categorical_mapping.org=).  Two code namespaces are reconciled: 2010-11
uses the fine 301-318 scheme (separate Donkey 305 / Mule-horse 306,
Chicken-layer 310 / -broiler 312, Turkey 314 / Guinea fowl 316, Beehive
317; Bull/ox shares code 304), while 2013-14 + IHS4/IHS5 use a coarser
scheme (Bull 304, Ox 3304, Donkey/Horse 3305, Chicken 3310,
Turkey/Guinea Fowl 3314, Dove/Pigeon 319).  Each code -> one canonical
species (no within-wave collapse, so =(t, i, animal)= stays unique); code
318 "Other (Specify)" -> NaN -> dropped from the index, like
=crop_production='s "Other" crop.

Keep-filter: a roster row is retained when the household genuinely holds
the species -- per-species ownership flag =ag_r01= == Yes, OR any
positive reported =HeadCount= / =HeadSold= / =HeadAcquired=.  Rows for
species the HH was merely asked about and does not own are dropped, so
the feature is the household's actual herd, not the full species
checklist.

Coverage cross-check (distinct livestock-owning HH per wave): the feature
matches the raw Module-R =ag_r00= == Yes universe within ~0.5% every wave
(2010-11: 5674 vs 5710; 2013-14: 1886 vs 1888; 2016-17: 6178 vs 6210;
2019-20: 6534 vs 6575).  The WB =Plot_dataset= livestock binary is much
smaller (1484 / 1835 / 1119 / 1249) because it is joined onto the
*plot-cultivating subsample* only -- so the item feature both is richer
AND spans the correct, broader livestock-keeping universe.

* Housing feature (added 2026-04-12)

Schema: =(t, i)= index, =Roof: str=, =Floor: str=.  Categorical material
names normalized to Title Case.

| Wave    | Module | File                                 | i       | Roof   | Floor  |
|---------+--------+--------------------------------------+---------+--------+--------|
| 2004-05 | G      | sec_g.dta                            | case_id | g09    | g10    |
| 2010-11 | F      | Full_Sample/Household/hh_mod_f.dta   | case_id | hh_f08 | hh_f09 |
| 2013-14 | F      | HH_MOD_F_13.dta                      | y2_hhid | hh_f08 | hh_f09 |
| 2016-17 | F      | Cross_Sectional/hh_mod_f.dta + Panel | case_id | hh_f08 | hh_f09 |
| 2019-20 | F      | Cross_Sectional/HH_MOD_F.dta + Panel | case_id | hh_f08 | hh_f09 |

Module letter changed from G (IHS2) to F (IHS3+).  Walls data (=hh_f07= /
=g08=) also available but excluded to match Uganda schema.  See
=.claude/skills/add-feature/housing/SKILL.md= for cross-country guidance.

* Files in Malawi/_/
** DONE malawi.py
Contains code common to different Malawi rounds. IHS3 through IHS5 have highly similar formats (column labels, etc.).

** DONE food_items.org

Should have columns for each year, with "Preferred Labels" and "Aggregate Labels".   Labels for different years:
#+begin_src python :results output raw table :tangle /tmp/test.py
from lsms.tools import from_dta
import dvc.api
import pyreadstat
import pandas as pd
from cfe.df_utils import df_to_orgtbl

Country = 'Malawi'

fs = dvc.api.DVCFileSystem('./')

itemlabel_location = {'2004-05':('sec_i.dta', 'i0a'),
                      '2010-11':('Full_Sample/Household/hh_mod_g1.dta','hh_g02'),
                      '2016-17':('hh_mod_g1.dta','hh_g02'),
                      '2019-20':('HH_MOD_G1.dta','hh_g02')}

reference_year = list(itemlabel_location.keys())[0]

itemlabels = {}
for k,v in itemlabel_location.items():
    try:
        with fs.open(f'/{Country}/{k}/Data/{v[0]}') as dta:
            df = from_dta(dta)
            itemlabels[k] = df[v[1]].value_counts().index.tolist()
    except ValueError:  # pd.io.stata can't read some versions of dta files...
        fs.get_file(f'/{Country}/{k}/Data/{v[0]}',f'/tmp/{v[0]}')
        df, meta = pyreadstat.read_dta(f'/tmp/{v[0]}')
        itemlabels[k] = list(meta.value_labels[v[1]].values())

# Build dictionary of dictionaries for matching
from collections import defaultdict
import difflib

D = defaultdict(dict)
#D.update({k.title():'Preferred Label' for k in itemlabels[reference_year]]})

itemlabels_reference = [s.strip().title() for s in itemlabels[reference_year]]

for wave in ['2004-05', '2010-11','2016-17', '2019-20']:
    for l in itemlabels[wave]:
        k = difflib.get_close_matches(l.title(),itemlabels_reference)
        if len(k):
            D[k[0]][wave] = l
        else:
            D[l][wave] = l

def preferred(s):
    t = s.strip().title()
    t = t.replace(' And ',' & ')
    t = t.replace(' / ','/')
    return t

# Regularize keys
D = {preferred(k):v for k,v in D.items()}

df = pd.DataFrame(D).T
df.index.name = 'Preferred Label'

print(df_to_orgtbl(df))
#+end_src

#+RESULTS:
Missing dependencies for OracleDemands.
| Preferred Label                             | 2004-05                    | 2010-11                                          | 2016-17                                          | 2019-20                                             |   |
| <20>                                        |                            |                                                  |                                                  |                                                     |   |
|                                             |                            |                                                  |                                                  |                                                     |   |
|---------------------------------------------+----------------------------+--------------------------------------------------+--------------------------------------------------+-----------------------------------------------------+---|
| Maize Ufa Mgaiwa (Normal Flour)             | Maize ufa mgaiwa (normal f | Maize ufa mgaiwa (normal flour)                  | Maize ufa mgaiwa (normal flour)                  | Maize ufa mgaiwa (normal flour)                     |   |
| Tomato Sauce (Bottle)                       | Tomato sauce (bottle)      | Tomato sauce (bottle)                            | Tomato sauce (bottle)                            | Tomato sauce (bottle)                               |   |
| Spices                                      | Spices                     | Spices                                           | Spices                                           | Spices                                              |   |
| Salt                                        | Salt                       | Salt                                             | Salt                                             | Salt                                                |   |
| Other Fats & Oil                            | Other fats and oil         | ---                                              | ---                                              | ---                                                 |   |
| Cooking Oil                                 | Cooking oil                | Cooking oil                                      | Cooking oil                                      | Cooking oil                                         |   |
| Sugar Cane                                  | Sugar cane                 | Sugar Cane                                       | Sugar Cane                                       | Sugar cane                                          |   |
| Sugar                                       | Sugar                      | Sugar                                            | Sugar                                            | Sugar                                               |   |
| Other Milk & Milk Products                  | Other milk and milk produc | ---                                              | ---                                              | ---                                                 |   |
| Infant Feeding Formula                      | Infant feeding formula     | Infant feeding formula (for bottle)              | Infant feeding formula (for bottle)              | Infant feeding formula (for bottle)                 |   |
| Cheese                                      | Cheese                     | Cheese                                           | Cheese                                           | Cheese                                              |   |
| Yoghurt                                     | Yoghurt                    | Yoghurt                                          | Yoghurt                                          | Yoghurt                                             |   |
| Chambiko - Soured Milk                      | Chambiko - soured milk     | Chambiko - soured milk                           | Chambiko - soured milk                           | Chambiko - soured milk                              |   |
| Butter                                      | Butter                     | Butter                                           | Butter                                           | Butter                                              |   |
| Margarine                                   | Margarine                  | Margarine - Blue band                            | Margarine - Blue band                            | Margarine - Blue band                               |   |
| Powdered Milk                               | Powdered milk              | Powdered milk                                    | Powdered milk                                    | Powdered milk                                       |   |
| Fresh Milk                                  | Fresh milk                 | Fresh milk                                       | Fresh milk                                       | Fresh milk                                          |   |
| Other Fruits                                | Other fruits               | Other fruits (specify)                           | Other fruits (specify)                           | Other fruits (specify)                              |   |
| Apple                                       | Apple                      | Apple                                            | Apple                                            | Apple                                               |   |
| Wild Fruit (Masau, Malambe, Etc.)           | Wild fruit (masau, mlambe, | Wild fruit (masau, malambe, etc.)                | Wild fruit (masau, malambe, etc.)                | Wild fruit (masau, malambe, etc)                    |   |
| Avocado                                     | Avocado                    | Avocado                                          | Avocado                                          | Avocado                                             |   |
| Guava                                       | Guava                      | Guava                                            | Guava                                            | Guava                                               |   |
| Papaya                                      | Papaya                     | Papaya                                           | Papaya                                           | Papaya                                              |   |
| Pineapple                                   | Pineapple                  | Pineapple                                        | Pineapple                                        | Pineapple                                           |   |
| Citrus, Naartje, Orange, Etc.               | Citrus, naartje, orange, e | Citrus – naartje, orange, etc.                   | Citrus – naartje, orange, etc.                   | Citrus – naartje, orange, etc                       |   |
| Banana                                      | Banana                     | Banana                                           | Banana                                           | Banana                                              |   |
| Mango                                       | Mango                      | Mango                                            | Mango                                            | Mango                                               |   |
| Yeast, Baking Powder, Bicarbonate of Soda   | Yeast, baking powder, bica | Yeast, baking powder, bicarbonate of soda        | Yeast, baking powder, bicarbonate of soda        | Yeast, baking powder, bicarbonate of soda           |   |
| Hot Sauce (Nali, Etc.)                      | Hot sauce (nali, etc.)     | Hot sauce (Nali, etc.)                           | Hot sauce (Nali, etc.)                           | Hot sauce (Nali, etc)                               |   |
| Tinned Meat Or Fish                         | Tinned meat or fish        | Tinned meat or fish                              | Tinned meat or fish                              | Tinned meat or fish                                 |   |
| Jam, Jelly, Honey                           | Jam, jelly, honey          | Jam, jelly                                       | Jam, jelly                                       | Jam, jelly                                          |   |
| Locally Brewed Liquor                       | Locally brewed liquor      | Locally brewed liquor (kachasu)                  | Locally brewed liquor (kachasu)                  | Locally brewed liquor (kachasu )                    |   |
| Wine Or Commercial Liquor                   | Wine or commercial liquor  | Wine or commercial liquor                        | Wine or commercial liquor                        | Wine or commercial liquor                           |   |
| Traditional Beer (Masase)                   | Traditional beer (masase)  | Traditional beer (masese)                        | Traditional beer (masese)                        | Traditional beer (masese)                           |   |
| Bottled/ Canned Beer                        | Bottled/ canned beer       | Bottled / canned beer (carlsberg, etc.)          | Bottled / canned beer (carlsberg, etc.)          | Bottled / canned beer (carlsberg, etc)              |   |
| Bottled Water                               | ---                        | Bottled water                                    | Bottled water                                    | Bottled water                                       |   |
| Chibuku (Commercial Traditional-Style Beer) | Chibuku/ Napolo            | Chibuku (commercial traditional-style beer)      | Chibuku (commercial traditional-style beer)      | Chibuku(commercial traditional-style beer)          |   |
| Soft Drinks (Coca-Cola, Fanta, Sprite, Etc.) | Soft drinks (coca cola, fa | Soft drinks (Coca-cola, Fanta, Sprite, etc.)     | Soft drinks (Coca-cola, Fanta, Sprite, etc.)     | Soft drinks (Coca-cola, Fanta, Sprite, etc)         |   |
| Freezes (Flavoured Ice)                     | Freezes (flavoured ice)    | Freezes (flavoured ice)                          | Freezes (flavoured ice)                          | Freezes (flavoured ice)                             |   |
| Fruit Juice                                 | Fruit juice                | Fruit juice                                      | Fruit juice                                      | Fruit juice                                         |   |
| Squash (Sobo Drink Concentrate)             | Squash (sobo drink concent | Squash (Sobo drink concentrate)                  | Squash (Sobo drink concentrate)                  | Squash (Sobo drink concentrate)                     |   |
| Coffee                                      | Coffee                     | Coffee                                           | Coffee                                           | Coffee                                              |   |
| Tea                                         | Tea                        | Tea                                              | Tea                                              | Tea                                                 |   |
| Other Cooked Foods                          | Other cooked foods         | ---                                              | ---                                              | ---                                                 |   |
| Meat Eaten At Restaurant                    | Meat eaten at restaurant   | Meal eaten at restaurant                         | Meal eaten at restaurant                         | Meal eaten at restaurant                            |   |
| Samosa (Vendor)                             | Samosa (vendor)            | Samosa (vendor)                                  | Samosa (vendor)                                  | Samosa (vendor)                                     |   |
| Mandazi, Doughnut (Vendor)                  | Mandazi, doughnut (vendor) | Mandazi, doughnut (vendor)                       | Mandazi, doughnut (vendor)                       | Mandazi, doughnut (vendor)                          |   |
| Fish (Vendor)                               | Fish (vendor)              | Fish (vendor)                                    | Fish (vendor)                                    | Fish (vendor)                                       |   |
| Meat (Vendor)                               | Meat (vendor)              | Meat (vendor)                                    | Meat (vendor)                                    | Meat (vendor)                                       |   |
| Chicken (Vendor)                            | Chicken (vendor)           | Chicken (vendor)                                 | Chicken (vendor)                                 | Chicken (vendor)                                    |   |
| Eggs - Boiled (Vendor)                      | Eggs - boiled (vendor)     | Eggs - boiled (vendor)                           | Eggs - boiled (vendor)                           | Eggs - boiled (vendor)                              |   |
| Cassava - Boiled (Vendor)                   | Cassava - boiled (vendor)  | Cassava - boiled (vendor)                        | Cassava - boiled (vendor)                        | Cassava - boiled (vendor)                           |   |
| Cassava - Roasted (Vendor)                  | ---                        | ---                                              | Cassava - roasted (vendor)                       | Cassava - roasted (vendor)                          |   |
| Chips (Vendor)                              | Chips (vendor)             | Chips (vendor)                                   | Chips (vendor)                                   | Chips (vendor)                                      |   |
| Maize - Boiled Or Roasted                   | Maize - boiled or roasted  | Maize - boiled or roasted (vendor)               | Maize - boiled or roasted (vendor)               | Maize - boiled or roasted (vendor)                  |   |
| Other Spices/Miscellaneous                  | Other spices/ miscellaneou | ---                                              | ---                                              | ---                                                 |   |
| Sweets, Candy, Chocolates                   | Sweets, candy, chocolates  | Sweets, candy, chocolates                        | Sweets, candy, chocolates                        | Sweets, candy, chocolates                           |   |
| Other Meat, Fish & Animal Products          | Other meat fish and animal | ---                                              | ---                                              | ---                                                 |   |
| Termites, Other Insects                     | Termites, other insect     | Termites, other insects (eg Ngumbi, caterpillar) | Termites, other insects (eg Ngumbi, caterpillar) | Termites, other insects (eg Ngumbi, caterpillar)    |   |
| Maize Ufa Refined (Fine Flour)              | Maize ufa refined (fine fl | Maize ufa refined (fine flour)                   | Maize ufa refined (fine flour)                   | Maize ufa refined (fine flour)                      |   |
| Pigeon Pea (Nandolo)                        | Pigeon pea (nandolo)       | Pigeonpea (nandolo)                              | Pigeonpea (nandolo)                              | Pigeon pea (nandolo)                                |   |
| Bean, White                                 | Bean, white                | Bean, white                                      | Bean, white                                      | Bean, white                                         |   |
| Other Roots & Tubers                        | Other roots and tubers     | ---                                              | ---                                              | ---                                                 |   |
| Cocoyam (Masimbi)                           | Cocoyam (masimbi)          | Cocoyam (masimbi)                                | Cocoyam (masimbi)                                | Cocoyam (masimbi)                                   |   |
| Plantain, Cooking Banana                    | Plantain, cooking banana   | Plantain, cooking banana                         | Plantain, cooking banana                         | Plantain, cooking banana                            |   |
| Potato Crisps                               | Potato crisps              | Potato crisps                                    | Potato crisps                                    | Potato crisps                                       |   |
| Irish Potato                                | Irish potato               | Irish potato                                     | Irish potato                                     | Irish Potato                                        |   |
| Orange Sweet Potato                         | Orange sweet potato        | Orange sweet potato                              | Orange sweet potato                              | Orange sweet potato                                 |   |
| White Sweet Potato                          | White sweet potato         | White sweet potato                               | White sweet potato                               | White sweet potato                                  |   |
| Cassava Flour                               | Cassava flour              | Cassava flour                                    | Cassava flour                                    | Cassava flour                                       |   |
| Cassava Tubers                              | Cassava tubers             | Cassava tubers                                   | Cassava tubers                                   | Cassava tubers                                      |   |
| Other Cereals                               | Other cereals              | ---                                              | ---                                              | ---                                                 |   |
| Infant Feeding Cereals                      | Infant feeding cereals     | Infant feeding cereals                           | Infant feeding cereals                           | Infant feeding cereals                              |   |
| Breakfast Cereal                            | Breakfast cereal           | Breakfast cereal                                 | Breakfast cereal                                 | Breakfast cereals                                   |   |
| Spaghetti, Macaroni, Pasta                  | Spaghetti, macaroni, pasta | Spaghetti, macaroni, pasta                       | Spaghetti, macaroni, pasta                       | Spaghetti, macaroni, pasta                          |   |
| Biscuits                                    | Biscuits                   | Biscuits                                         | Biscuits                                         | Biscuits                                            |   |
| Buns, Scones                                | Buns, scones               | Buns, scones                                     | Buns, scones                                     | Buns, scones                                        |   |
| Bread                                       | Bread                      | Bread                                            | Bread                                            | Bread                                               |   |
| Wheat Flour                                 | Wheat flour                | Wheat flour                                      | Wheat flour                                      | Wheat flour                                         |   |
| Pearl Millet                                | Pearl millet               | Pearl millet (mchewere)                          | Pearl millet (mchewere)                          | Pearl millet (mchewere)                             |   |
| Sorghum                                     | Sorghum                    | Sorghum (mapira)                                 | Sorghum (mapira)                                 | Sorghum (mapira)                                    |   |
| Finger Millet                               | Finger millet              | Finger millet (mawere)                           | Finger millet (mawere)                           | Finger millet (mawere)                              |   |
| Rice                                        | Rice                       | Rice                                             | Rice                                             | Rice                                                |   |
| Green Maize                                 | Green maize                | Green maize                                      | Green maize                                      | Green Maize                                         |   |
| Maize Grain (Not As Ufa)                    | Maize grain (not as ufa)   | Maize grain (not as ufa)                         | Maize grain (not as ufa)                         | Maize grain (not as ufa)                            |   |
| Maize Ufa Madeya (Bran Flour)               | Maize ufa madeya (bran flo | Maize ufa madeya (bran flour)                    | Maize ufa madeya (bran flour)                    | Maize ufa processed madeya (bran flour - processed) |   |
| Bean, Brown                                 | Bean, brown                | Bean, brown                                      | Bean, brown                                      | Bean, brown                                         |   |
| Groundnut                                   | Groundnut                  | Groundnut                                        | Boiled groundnuts                                | Boiled groundnuts                                   |   |
| Small Animal - Rabbit, Mice, Etc.           | Small animal- rabbit, mice | Small animal – rabbit, mice, etc.                | Small animal – rabbit, mice, etc.                | Small animal – rabbit, mice, etc                    |   |
| Groundnut Flour                             | Groundnut flour            | Groundnut flour                                  | Groundnut flour                                  | Groundnut flour                                     |   |
| Groundnut (Shelled)                         | ---                        | ---                                              | Groundnut (Shelled)                              | Groundnut (Shelled)                                 |   |
| Other Poultry - Guinea Fowl, Doves, Etc.    | Other poultry-guinea fowl, | Other poultry - guinea fowl, doves, etc.         | Other poultry - guinea fowl, doves, etc.         | Other poultry - guinea fowl, doves, etc             |   |
| Chicken                                     | Chicken                    | Chicken                                          | Chicken                                          | Chicken - Whole                                     |   |
| Pork                                        | Pork                       | Pork                                             | Pork                                             | Pork                                                |   |
| Goat                                        | Goat                       | Goat                                             | Goat                                             | Goat                                                |   |
| Beef                                        | Beef                       | Beef                                             | Beef                                             | Beef                                                |   |
| Fresh Fish                                  | Fresh fish                 | Fresh fish                                       | ---                                              | ---                                                 |   |
| Sun Dried Fish                              | Dried fish                 | Dried fish                                       | ---                                              | ---                                                 |   |
| Other Vegetable                             | Other vegetable            | Other vegetables (Specify)                       | Other vegetables (Specify)                       | ---                                                 |   |
| Tinned Vegetables                           | Tinned vegetables          | Tinned vegetables (Specify)                      | Tinned vegetables (Specify)                      | Tinned vegetables (specify)                         |   |
| Okra/Therere                                | Okra / Therere             | Okra / Therere                                   | Okra / Therere                                   | Okra / Therere                                      |   |
| Pumpkin                                     | Pumpkin                    | Pumpkin                                          | Pumpkin                                          | Pumpkin                                             |   |
| Cucumber                                    | Cucumber                   | Cucumber                                         | Cucumber                                         | Cucumber                                            |   |
| Tomato                                      | Tomato                     | Tomato                                           | Tomato                                           | Tomato                                              |   |
| Gathered Wild Green Leaves                  | Gathered wild green leaves | Gathered wild green leaves                       | Gathered wild green leaves                       | Gathered wild green leaves                          |   |
| Other Cultivated Green Leafy Vegetables     | Other cultivated green lea | Other cultivated green leafy vegetables          | Other cultivated green leafy vegetables          | Other cultivated green leafy vegetables             |   |
| Chinese Cabbage                             | Chinese cabbage            | Chinese cabbage                                  | Chinese cabbage                                  | Chinese cabbage                                     |   |
| Nkwani                                      | Nkwani                     | Nkhwani                                          | Nkhwani                                          | Nkhwani                                             |   |
| Tanaposi Rape                               | Tanaposi rape              | Tanaposi/Rape                                    | Tanaposi/Rape                                    | Tanaposi/Rape                                       |   |
| Cabbage                                     | Cabbage                    | Cabbage                                          | Cabbage                                          | Cabbage                                             |   |
| Onion                                       | Onion                      | Onion                                            | Onion                                            | Onion                                               |   |
| Other Pulses                                | Other pulses               | ---                                              | ---                                              | ---                                                 |   |
| Cowpea (Khobwe)                             | Cowpea (khobwe)            | Cowpea (khobwe)                                  | Cowpea (khobwe)                                  | Cowpea (khobwe)                                     |   |
| Ground Bean                                 | Ground bean                | Ground bean (nzama)                              | Ground bean (nzama)                              | Ground bean (nzama)                                 |   |
| Soyabean Flour                              | Soyabean flour             | Soyabean flour                                   | Soyabean flour                                   | Soyabean flour                                      |   |
| Other Beverages                             | Other beverages            | ---                                              | ---                                              | ---                                                 |   |
| Eggs                                        | Eggs                       | Eggs                                             | Eggs                                             | Eggs                                                |   |
| Other                                       | ---                        | Other (specify)                                  | Other (specify)                                  | Other (specify)                                     |   |
| Fish Soup/Sauce                             | ---                        | Fish Soup/Sauce                                  | Fish Soup/Sauce                                  | Fish Soup/Sauce                                     |   |
| Thobwa                                      | Local sweet beer (thobwa)  | Thobwa                                           | Thobwa                                           | Thobwa                                              |   |
| Maheu                                       | ---                        | Maheu                                            | Maheu                                            | Maheu                                               |   |
| Honey                                       | ---                        | Honey                                            | Honey                                            | Honey                                               |   |
| Mutton                                      | ---                        | Mutton                                           | Mutton                                           | Mutton                                              |   |
| Mushroom                                    | ---                        | Mushroom                                         | Mushroom                                         | Mushroom                                            |   |
| Macademia Nuts                              | ---                        | Macademia nuts                                   | Macademia nuts                                   | Macademia nuts                                      |   |
| Smoked Fish (Medium Variety)                | ---                        | ---                                              | Smoked fish (Medium Variety)                     | Smoked fish (Medium Variety)                        |   |
| Smoked Fish (Large Variety)                 | ---                        | ---                                              | Smoked fish (Large Variety)                      | Smoked fish (Large Variety)                         |   |
| Fresh Fish (Small Variety)                  | ---                        | ---                                              | Fresh fish (Small Variety)                       | Fresh fish (Small Variety)                          |   |
| Fresh Fish (Medium Variety)                 | ---                        | ---                                              | Fresh fish (Medium Variety)                      | Fresh fish (Medium Variety)                         |   |
| Fresh Fish (Large Variety)                  | ---                        | ---                                              | Fresh fish (Large Variety)                       | Fresh fish (Large Variety)                          |   |
| Sun Dried Fish (Small Variety)              | ---                        | ---                                              | Sun Dried fish (Small Variety)                   | Sun Dried fish (Small Variety)                      |   |
| Sun Dried Fish (Medium Variety)             | ---                        | ---                                              | Sun Dried fish (Medium Variety)                  | Sun Dried fish (Medium Variety)                     |   |
| Sun Dried Fish (Large Variety)              | ---                        | ---                                              | Sun Dried fish (Large Variety)                   | Sun Dried fish (Large Variety)                      |   |
| Zikondamoyo/Nkate                           | ---                        | ---                                              | Zikondamoyo/Nkate                                | Zikondamoyo / Nkate                                 |   |
| Popcorn                                     | ---                        | ---                                              | Popcorn                                          | Popcorn                                             |   |
| Groundnut Fresh (Unshelled)                 | ---                        | ---                                              | ---                                              | Groundnut Fresh (UnShelled)                         |   |
| Smoked Fish (Small Variety)                 | ---                        | ---                                              | Smoked fish (Small Variety)                      | Smoked fish (Small Variety)                         |   |
| Cocoa, Milo                                 | ---                        | Cocoa, millo                                     | Cocoa, millo                                     | Cocoa, milo                                         |   |
| Kalongonda (Mucuna)                         | ---                        | ---                                              | ---                                              | KALONGONDA (Mucuna)                                 |   |
| Groundnut Dried (Unshelled)                 | ---                        | ---                                              | Groundnut (unshelled)                            | Groundnut Dried (UnShelled)                         |   |
| Smoked Fish                                 | ---                        | Smoked fish                                      | ---                                              | ---                                                 |   |
| Sweet Potato - Boiled (Vendor)              | ---                        | ---                                              | Boiled sweet potatoes                            | Boiled sweet potatoes                               |   |
| Sweet Potato - Roasted (Vendor)             | ---                        | ---                                              | Rosted sweet potatoes                            | Roasted sweet potatoes                              |   |
| Groundnut - Roasted (Vendor)                | ---                        | ---                                              | Rosted groundnuts                                | Roasted groundnuts                                  |   |
| Maize Ufa Madeya (Bran Flour, Unprocessed)  | ---                        | ---                                              | ---                                              | Maize ufa raw madeya (bran flour - unprocessed)     |   |
| Chicken - Pieces                            | ---                        | ---                                              | Chicken/pieces                                   | Chicken - Pieces                                    |   |

** TODO conversion_to_kgs.json -- GitHub Issue #116
IHS3-IHS5 have conversion tables provided to convert various item units into kilograms. Values for conversion factors were broken down by region and source type, and there is a unique table for ISH3 and ISH5. Documentation indicates that similar methods were used for ISH4, so unit conversions were taken from ISH3--the factors can be found in the csv file /2013/_. Please see IHS3’s document entitled “Malawi_IHS3_Food_Item_Conversion_Factors.pdf” for more information on how this was conducted. For the intents of conversion to kg for ISH5 as it contains several conservation factors for each food/unit/region combination, the mean of conversion factors was taken to populate the factors column. There are some minor issues where item naming does not match up perfectly between the conversion table and the food acquired ones. Names from the conversion table were slightly cleaned, but using a similar method as the one for constructing food_items.org may be better. ISH2 does not have any information on food conversion.

Some items have additionally specified unit names found under “unitsdetail_” because they were not among the standard units. Some of these have names such as ‘200 GRAMS’ that indicate the units in a manner that can be converted easily to kg. Conversion factors were additionally updated with information from these columns. Only consumption and expenditure quantities were converted for now.
For items that have such unit conversions already done, they were scaled by the conversion factor given or otherwise specified.

*** Known gaps and issues
- No =conversion_to_kgs.json= file has been generated :: Despite the
  conversion factor data being available in wave-specific =.dta= files,
  the final JSON file used by the pipeline has not been created.
- IHS2 (2004-05) has no conversion information :: The earliest wave
  lacks any unit-to-kg conversion factors entirely.
- Item name mismatches :: Food item names in the conversion tables do
  not perfectly align with labels in =food_acquired=. A fuzzy-matching
  approach (similar to =food_items.org= construction) is needed.
- Incomplete quantity coverage :: Only consumption and expenditure
  quantities were converted; production and in-kind receipt quantities
  are not yet handled.
- Source data available in DVC ::
  - =2016-17/Data/Cross_Sectional/com_cf1.dta=, =com_cf2.dta= (community
    conversion factors)
  - =2019-20/Data/Cross_Sectional/ihs_foodconversion_factor_2020.dta=
    (dedicated food conversion table)
  - =2019-20/Data/Cross_Sectional/caloric_conversionfactor.dta= (caloric
    conversion factors)
  - =2010-11/Documentation/Malawi_IHS3_Food_Item_Conversion_Factors.pdf=
    (methodology documentation)
- What is needed to fix ::
  1. Build =conversion_to_kgs.json= by reading the wave-specific
     conversion factor =.dta= files and computing median factors per
     unit, similar to the Ethiopia and Tanzania approach.
  2. Harmonize item names between conversion tables and =food_items.org=
     using fuzzy matching.
  3. For IHS2, consider using IHS3 factors as a proxy, or use FAO
     standard conversion factors.
  4. Extend conversion to cover all quantity columns (production,
     in-kind receipt), not just consumption and expenditure.

** RETIRED other_features.py
=other_features= is obsolete (per top-level =CLAUDE.md=); replaced by
=cluster_features= + =_add_market_index()= at query time.
** RETIRED household_characteristics.py (2026-05-05)
=Country('Malawi').household_characteristics()= now derives from
=household_roster= via =transformations.roster_to_characteristics=
(=country.py:2574-2596=, =_ROSTER_DERIVED=); no Malawi-level script
exists or is needed.  The dead Makefile rule has been removed.  See
GH #218.
** DONE food_acquired.py

Test...
#+begin_src python :results output
import pandas as pd

fa = pd.read_parquet('../var/food_acquired.parquet')

print(fa.describe())
#+end_src

** RETIRED food_prices_quantities_and_expenditures.py (2026-05-05)
Removed in favour of the framework's =_FOOD_DERIVED= path
(=country.py:2541-2571=).  =Country('Malawi').food_expenditures()=,
=.food_prices()=, and =.food_quantities()= now derive from
=food_acquired= via =transformations.food_*_from_acquired= rather
than reading wave-level parquets that this script previously
materialised.

The Makefile rule that produced =var/food_{expenditures,prices,quantities}.parquet=
has been removed; the (already-shadowed) parquets at those paths are
no longer regenerated by =make=.  See GH #218 for the cross-country
plan to retire =harmony.py= and the remaining 11 country-level
instances of this script.

Quick sanity check from the API instead:
#+begin_src python :results output
import lsms_library as ll

c = ll.Country('Malawi')
print(c.food_expenditures().describe())
print(c.food_prices().describe())
print(c.food_quantities().describe())
#+end_src

** TODO Food Conversion Table (FCT) -- GitHub Issue #116
- What is missing :: A Food Composition Table mapping food items to
  nutritional content (calories, protein, fat, etc.) has not been
  assembled for Malawi.
- What exists :: The IHS5 (2019-20) wave includes
  =caloric_conversionfactor.dta= which contains caloric data that
  could be leveraged. No =nutrition.py= or FCT pipeline exists yet.
- Survey documentation :: IHS5 documentation includes a "Household Food
  Consumption Aid" (DVC-tracked in =2019-20/Documentation/=) which may
  contain relevant nutritional reference data.
- What is needed to fix ::
  1. Extract caloric conversion factors from
     =2019-20/Data/Cross_Sectional/caloric_conversionfactor.dta=.
  2. Map food items to a standard FCT (e.g., FAO or USDA FoodData
     Central) using "Preferred Labels" from =food_items.org=.
  3. Create =nutrition.py= and a structured FCT file in =Malawi/_/=.
  4. Note: The caloric data in the survey itself provides a head start
     that Ethiopia and Tanzania lack.

* Sampling Design
** Overview
Malawi has five waves from two survey programs:
- IHS2 (2004-05): cross-sectional, 11,280 households
- IHS3 (2010-11): cross-sectional, 12,271 households
- IHPS (2013-14): panel only (tracked from IHS3), 4,000 households
- IHS4 (2016-17): cross-sectional (12,447) + panel (2,508) = 14,955 households
- IHS5 (2019-20): cross-sectional (11,434) + panel (3,178) = 14,612 households
  (this line read "= 14,552" until 2026-07; the two addends were right and
  the total was a typo.  14,612 is what =sample()=, =household_roster()= and
  =cluster_features='s =df_main= all return for the wave.)

** Strata
District serves as the stratification variable across all waves (~30-32
districts). The 2013-14 IHPS file also has an explicit =stratum= column
with 6 Region x Rural values, but we use =district= for consistency.
District names vary slightly across waves (e.g., "Blanytyre" vs
"Blantyre", "Nkhatabay" vs "Nkhata Bay"); these are harmonized via the
=strata= table in =categorical_mapping.org=.

** Cluster (PSU)
- 2004-05: =psu= (string, 564 unique EAs)  -- *was* =ea=; see below
- 2010-11 onward: =ea_id= (string, 200--800 unique EAs per wave)

Every wave's =v= is the same object in the same format: the *fully qualified
8-digit Malawi enumeration-area code*, =region(1) + district(2) + TA(2) +
EA(3)= -- e.g. =10101016= is EA 016 of TA 01 of district 01 (Chitipa) of
region 1 (North).

*** GH #323: 2004-05's cluster key was not a cluster key

Until this was fixed, 2004-05 declared =v: ea=.  =ea= is *the EA's sequence
number within its Traditional Authority*, so it takes only *110 distinct
values for IHS2's 564 enumeration areas*.  Keyed on =ea=, roughly five
unrelated EAs -- in different TAs, districts and regions -- merged into one
=v=, and the household -> cluster projection in =Wave.cluster_features= then
resolved the disagreement with =groupby().first()=: one arbitrary household's
answer, served as the cluster's.

What that destroyed, measured cold:

| quantity                                            | =v: ea= | =v: psu= |
|-----------------------------------------------------+---------+----------|
| clusters                                            |     110 |      564 |
| districts present in =cluster_features=             |      20 |       26 |
| settlement strata present in =cluster_features=     | 1 (all =Rural=) |        2 |
| contested cluster-attribute cells (of 330 / 1,692)  |     164 |    *0* |

The urban stratum did not merely lose rows -- it disappeared.  All 110
surviving clusters came out =Rural=, because =first()= happened to reach a
rural household in every merged group.  Six of Malawi's 26 districts vanished
from =cluster_features= entirely.  Both facts were invisible at the API: the
table looked complete, it was just wrong.

=psu= is the fully qualified code, already present in =sec_a.dta=: 564 values,
*exactly 20 households each* (the IHS2 design), and *zero* households in a
cluster disagreeing about their cluster's region, district or urban/rural
status.  It is declared identically in =sample= and in =cluster_features=,
because =_join_v_from_sample= joins the two through =v= and they cannot be
allowed to drift.

Note the *frame vintage*: 2004-05 shares only 3 codes with 2010-11.  IHS2 is
drawn from the 1998 census frame and IHS3+ from the 2008 frame, so the code
*format* is common across all five waves but the code *sets* are not.  A
cross-wave join on =v= is meaningful from 2010-11 onward and not before.

*** GH #323: what remains contested, and why it is NOT re-keyed

After the fix, three waves still have clusters whose households disagree.  In
every case the measurement says the identifier is *right* and the households
have *moved* -- these are tracked panels, and re-keying on the current district
would fracture real EAs, desynchronise =v= from =sample=, and sever the panel's
link to its own baseline.

| wave    | contested cells | of    | what they are                                |
|---------+-----------------+-------+----------------------------------------------|
| 2004-05 |           *0*   | 1,692 | --                                           |
| 2010-11 |           *0*   | 3,840 | --                                           |
| 2013-14 |             765 | 1,020 | IHPS tracked movers (see below)              |
| 2016-17 |              75 | 4,400 | IHPS-2016 =reside= is current, not baseline  |
| 2019-20 |             250 | 4,095 | IHPS tracked movers                          |

**** 2013-14 (IHPS): the GPS is the proof
=ea_id= here is the *IHS3 baseline EA* -- 204 of IHS3's 768, and =case_id= is
literally =ea_id= + household number.  The survey tracks movers and split-off
households wherever they go (4,000 interviewed households from 3,104 baseline
households), and the file's =region= / =district= / =reside= / geovariables all
describe the household's *current* location.

188 of 204 EAs have households reporting different coordinates, which is
exactly the broken-key signature.  It is not one.  Restrict to households that
did *not* move (=dist_to_IHS3location= <= 1 km) and *every one of the 204 EAs
collapses to exactly one coordinate* -- =LAT_DD_MOD= is the EA-level displaced
fix of the household's current location, not per-household jitter.  All of the
within-EA spread (median 145 km, max 775 km) is dispersal.

Corroborating: 588 of 4,000 households report a district different from the one
encoded in their own =ea_id=, and those 588 sit a *median 68 km* from their
IHS3 location against *0.03 km* for the 3,412 that match.

**** 2016-17 (IHS4 + IHPS4)
The 75 remaining cells are all =Rural=, all in the panel half.  IHPS-2016
records =district= / =region= at *baseline* (0 of 2,508 households sit outside
their EA's modal district) but =reside= *currently* -- 277 households differ
from their EA's modal =reside= and 246 of those are flagged =mover=.  So one
file mixes baseline and current geography; that is the survey's inconsistency,
not ours.

EA =30305580= is sampled in *both* the Cross_Sectional and the Panel halves.
That is a genuine shared EA (same district), not a code collision -- the two
halves spelled its region =Southern= and =South=, which used to read as a
disagreement.  The =region= table is now applied at extraction, so it does not.

**** 2019-20 (IHS5 + IHPS5)
All 250 cells are in the panel half.  Unlike 2016-17, IHPS-2019 records
=district= / =region= *currently*: 747 of 3,178 households are outside their
EA's modal district, and 652 of those are more than 1 km from their IHS3
location.  The 102 panel EAs share no =ea_id= with the 717 cross-sectional
ones, so there is no cross-half collision here at all.

*** GH #323: 2016-17 had no GPS, and the reason was a merge key
=cluster_features= builds =i= for the Cross_Sectional half by running =case_id=
through =cs_i= (='cs-17-'= + =format_id=), to keep it apart from the Panel's
=y3_hhid=.  The =df_geo= block declared the *raw* =case_id=, so its merge key
never matched anything: the =how='outer'= join produced 12,447 orphan geo rows
alongside 14,955 main rows with no coordinates, and *0 of 880 clusters had
GPS*.  =df_geo= now builds =i= exactly as =df_main= does; the two files are
1:1 on =case_id= (12,447 = 12,447), so the join is exact and *779 of 880*
clusters carry coordinates.  The remaining 101 are the IHPS panel EAs, for
which IHS4 publishes no geovariables file.

Cost of that fix, stated plainly: 7 of the 779 EAs have households whose IHS4
=lat_modified= differs within the EA (IHS4's displacement is *nearly* but not
exactly EA-constant), so =Latitude= / =Longitude= now show 7 contested cells
where before there were none -- because before there was no coordinate at all.

*** FIXED: two cartesian =df_geo= merges (Site 4, PR #627)
2010-11 and 2019-20 *used to* key a *household-grain* geovariables file on
=ea_id= and merge it on the *cluster* key =v=, so =pd.merge= paired every
household with every geo row sharing that =v=:

| wave    | households | geo rows | merged rows | phantom | after  |
|---------+------------+----------+-------------+---------+--------|
| 2010-11 |     12,271 |   12,271 |     196,083 | 183,812 | 12,271 |
| 2019-20 |     14,612 |   11,434 |     185,842 | 171,230 | 14,612 |

Between them, 355,042 rows that exist in no survey -- 7.2% of the 4,907,774
phantom rows PR #627's 40-country census found.  =_normalize_dataframe_index=
then mopped the wreck up with =groupby().first()= down to 768 / 819 clusters,
so the table read clean at every point anyone ever looked.

Both geo files carry =case_id=, so the honest key was there all along.  Both
are now =idxvars: {i: case_id}= + =merge_on: [i]= (2019-20's runs =case_id=
through =cs_i=, exactly as its =df_main= does -- get that wrong and the join
matches nothing, which is the failure 2016-17 was in).  Measured cold, in an
isolated data root, with #627's cardinality guard on: *phantom rows 183,812 ->
0 and 171,230 -> 0*.

*The values do not move.*  The published lat/lon is the EA's *displaced fix
stamped on every household of the EA*, not a household fix -- verified: 0 of
768 EAs (2010-11) and 0 of 717 (2019-20) carry more than one distinct
coordinate, the two files are exactly 1:1 on =case_id= with no rows on either
side alone, and =df_main.ea_id == df_geo.ea_id= for every shared household.  So
handing each household its own row returns the coordinate the =v=-merge was
already returning it.  The full country-level =cluster_features= frame (3,235
rows x 5 columns, all five waves) is *bit-for-bit identical* before and after:
=DataFrame.equals= True, index equal, dtypes equal.

One honest wrinkle, at *household* grain only: 8 rows of the IHS5 geo file have
a NULL coordinate while their 15 EA siblings carry the EA's fix.  Under the
=v=-merge those 8 households borrowed a sibling's value; under the =i=-merge
they get their own NULL.  =cluster_features= is returned at =(t, v)= grain and
=.first()= skips NA, so the cluster still reports the EA's coordinate and the
returned table is unchanged -- but the household-grain intermediate now tells
the truth about which rows the survey actually geolocated.

Unchanged and *not* a defect: the 102 IHPS panel EAs of 2019-20 share no
=ea_id= and no household id with the geo file (0 overlap on either), because
IHS5 publishes no geovariables for the panel half.  Those clusters carry NaN
coordinates before and after.

** Weights
| Wave    | Cross-section weight | Panel weight       | Source file                                |
|---------+----------------------+--------------------+--------------------------------------------|
| 2004-05 | =hhwght=             | same (baseline)    | =sec_a.dta=                                |
| 2010-11 | =hh_wgt=             | same (IHS3 CS)     | =Full_Sample/Household/hh_mod_a_filt.dta=  |
| 2013-14 | =hh_wgt=             | =panelweight=      | =HH_MOD_A_FILT_13.dta=                    |
| 2016-17 | =hh_wgt= (both)      | =panelweight_2016= | CS + =Panel/hh_mod_a_filt_16.dta=          |
| 2019-20 | =hh_wgt= (both)      | =panelweight_2019= | CS + =Panel/hh_mod_a_filt_19.dta=          |

For 2016-17 and 2019-20, the cross-sectional file provides =hh_wgt= for
all CS households; the panel file provides both =hh_wgt= and the
wave-specific =panelweight_YYYY=. Cross-sectional households have
=panel_weight= = NaN since they are not tracked longitudinally.

** Urban/Rural
The =reside= column appears in all cover page files but with varying
case: "Rural"/"Urban", "rural"/"urban", "RURAL"/"URBAN". Harmonized to
"Rural"/"Urban" via the =Rural= table in =categorical_mapping.org=.

* Files in Malawi/<SOMEYEAR>/_/
** RETIRED household_characteristics.py
Now derived at API time via =transformations.roster_to_characteristics=
from =household_roster=.  No wave-level script ever existed for Malawi.
See GH #218.
** DONE food_acquired.py
** RETIRED other_features.py
=other_features= is obsolete (per top-level =CLAUDE.md=).
